<a href="https://colab.research.google.com/github/souvik500/Python-Assessment/blob/main/Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Task 1

Solution - 
Select d.NAME as "DEPT_NAME", avg(s.AMT) as "AVG_MONTHLY_SALARY (USD)" from Salaries as s
join Employees as e  On e.id=s.EMP_ID
Join Departments as d  On d.ID=e.DEPT_ID
Group by d.Name
order by avg(s.AMT) desc limit 3 ;

# Task 2

In [ ]:
import pandas as pd

In [ ]:
departments=pd.read_csv("C:/Users/91982/Desktop/assignment/Departments.csv")

In [ ]:
employees=pd.read_csv("C:/Users/91982/Desktop/assignment/Employees.csv")

In [ ]:
salaries=pd.read_csv("C:/Users/91982/Desktop/assignment/Salaries.csv")

In [ ]:
df=pd.merge(departments,employees, left_on='ID',right_on='DEPT_ID')

In [ ]:
data= pd.merge(df,salaries,left_on="ID_y",right_on='EMP_ID')

In [ ]:
data

,ID_x,NAME_x,ID_y,NAME_y,DEPT_ID,EMP_ID,MONTH,AMT,month_paart
0,1,HR,1,Jack,1,1,14-08-2453,5000,NaN
1,1,HR,1,Jack,1,1,15-08-2453,5000,NaN
2,1,HR,2,John,1,2,14-08-2453,4000,NaN
3,1,HR,2,John,1,2,15-08-2453,4000,NaN
4,1,HR,10,Shirley,1,10,14-08-2453,4800,NaN
...,...,...,...,...,...,...,...,...,...
166,5,Sales,16,Howard,5,16,20-11-2453,7500,NaN
167,5,Sales,16,Howard,5,16,21-11-2453,7500,NaN
168,5,Sales,21,Bruce,5,21,19-11-2453,4800,NaN
169,5,Sales,21,Bruce,5,21,20-11-2453,4800,NaN
170,5,Sales,21,Bruce,5,21,21-11-2453,4800,NaN

In [ ]:
x=data.groupby(['NAME_x'])['AMT'].mean()

In [ ]:
x.sort_values(ascending=False).head(3)

NAME_x
Sales      7045.16129
Ops        6420.00000
Finance    6360.31746
Name: AMT, dtype: float64

# Task 3

Question - 
def compute(n):
    if n < 10:
        out = n ** 2
    elif n < 20:
        out = 1
        for i in range(1, n-10):
            out *= i
    else:
        lim = n - 20
        out = lim * lim
        out = out - lim
        out = out / 2 
    print(out)

In [ ]:
def compute(n):
    if n < 10:
        out = n ** 2
    elif n < 20:
        out = 1
        for i in range(1, n-9):
            out *= i
    else:
        lim = n - 19
        out = lim * lim
        out = out - lim
        out = out / 2
    print(out)

In [ ]:
n = int(input("Enter an integer: "))
compute(n)

Enter an integer: 44
300.0